In [1]:
import pandas as pd
df = pd.read_csv('supershop.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

#### Standardization, or mean removal and variance scaling

In [2]:
from sklearn.preprocessing import StandardScaler

In [3]:
scaler = StandardScaler()

In [4]:
scaler

StandardScaler()

#### Use Fit Transform

In [5]:
scaler_fit = scaler.fit(df[['Marketing Spend']]) # model fit

In [6]:
scaler_fit

StandardScaler()

In [21]:
scaler_fit.mean_

array([ 73721.6156    , 121344.6396    , 215331.73244898])

In [7]:
df['Marketing Spend'] = scaler.transform(df[['Marketing Spend']]) # transform

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [9]:
# together use of fit and transform
df.Administration = scaler.fit_transform(df[['Administration']])

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

#### Use fit Transform for all column

In [11]:
import pandas as pd
df2 = pd.read_csv('supershop.csv')

df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [12]:
x = df2.drop('Profit', axis=1) # axis for row 0, column 1
y = df2['Profit']

In [13]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [14]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [15]:
# delete multiple column
new_x = df2.drop(['Area', 'Profit'], axis=1) 
new_x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [16]:
newx = scaler.fit_transform(new_x)

In [17]:
newx.shape

(50, 3)

In [18]:
newx[0:5, 0:3]

array([[ 0.89791312,  0.56075291,  2.1652875 ],
       [ 1.95586034,  1.08280658,  1.92984309],
       [ 1.75436374, -0.72825703,  1.62619068],
       [ 1.55478369, -0.09636463,  1.41734795],
       [ 1.5049372 , -1.07991935,  1.27354954]])

In [19]:
data = pd.DataFrame(newx, columns=['Marketing Spend', 'Administration', 'Transport'])

In [20]:
data.head()

   Marketing Spend  Administration  Transport
0         0.897913        0.560753   2.165287
1         1.955860        1.082807   1.929843
2         1.754364       -0.728257   1.626191
3         1.554784       -0.096365   1.417348
4         1.504937       -1.079919   1.273550